In [7]:
import pandas
pandas.__version__

'0.24.1'

In [8]:
import pandas as pd

In [9]:
#pandas series object
data = pd.Series([1.25, 2.5, 3.75, 4.0])
data

0    1.25
1    2.50
2    3.75
3    4.00
dtype: float64

In [10]:
data.values

array([1.25, 2.5 , 3.75, 4.  ])

In [11]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
data[3]

4.0

In [13]:
data[1:3]

1    2.50
2    3.75
dtype: float64

In [14]:
data = pd.Series([1.25, 2.5, 3.75, 4.0],
                 index=['a', 'b', 'c', 'd'])
data

a    1.25
b    2.50
c    3.75
d    4.00
dtype: float64

In [15]:
data['b']

2.5

In [16]:
data = pd.Series([1.25, 2.5, 3.75, 4.0],
                 index=[1, 2, 3, 4])
data

1    1.25
2    2.50
3    3.75
4    4.00
dtype: float64

In [17]:
type(data)

pandas.core.series.Series

In [45]:
dict = {'Texas': 38332521,
        'Austin': 26448193,
        'New York': 19651127,
        'Illinois': 19552860,
        'Utah': 12882135}
population = pd.Series(dict)
population

Texas       38332521
Austin      26448193
New York    19651127
Illinois    19552860
Utah        12882135
dtype: int64

In [46]:
type(dict)

dict

In [47]:
type(population)

pandas.core.series.Series

In [49]:
population['New York']

19651127

In [50]:
population['Texas':'Illinois']

Texas       38332521
Austin      26448193
New York    19651127
Illinois    19552860
dtype: int64

In [51]:
data = [10, 20, 30]
index = ['a', 'b', 'c']

In [62]:
dict = pd.DataFrame({'data': data,
                       'index': index})
dict

   data index
0    10     a
1    20     b
2    30     c

In [63]:
type(dict)

pandas.core.frame.DataFrame

In [64]:
dict.index

RangeIndex(start=0, stop=3, step=1)

In [65]:
dict.columns

Index(['data', 'index'], dtype='object')

In [66]:
dict.keys()

Index(['data', 'index'], dtype='object')

In [67]:
dict['data']

0    10
1    20
2    30
Name: data, dtype: int64

In [68]:
dict['index']

0    a
1    b
2    c
Name: index, dtype: object

In [79]:
import numpy as np
pd.DataFrame(np.random.rand(3, 2),
             columns=['xoo', 'zoo'],
             index=['a', 'b', 'c'])

        xoo       zoo
a  0.122221  0.612741
b  0.809189  0.395220
c  0.502794  0.223607

In [80]:
df = pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69],
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                   'height':[165, 70, 120, 80, 180, 172, 150],
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2],
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']
                   },
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])

In [81]:
df

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [82]:
#Selecting a single row with .loc with a string
df.loc['Penelope']

age           4
color     white
food      Apple
height       80
score       3.3
state        AL
Name: Penelope, dtype: object

In [83]:
#Selecting multiple rows with .loc with a list of strings
df.loc[['Cornelia', 'Jane', 'Dean']]

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

In [84]:
#Selecting multiple rows with .loc with slice notation
df.loc['Aaron':'Dean']

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK

In [85]:
#.iloc selects data only by integer location
df.iloc[4]

age           32
color       gray
food      Cheese
height       180
score        1.8
state         AK
Name: Dean, dtype: object

In [86]:
#Selecting multiple rows with .iloc with a list of integers
df.iloc[[2, -2]]

           age  color   food  height  score state
Aaron       12    red  Mango     120    9.0    FL
Christina   33  black  Melon     172    9.5    TX

In [87]:
#Selecting multiple rows with .iloc with slice notation
df.iloc[2:3]

       age color   food  height  score state
Aaron   12   red  Mango     120    9.0    FL

In [88]:
#Simultaneous selection of rows and columns with .loc and .iloc
df.loc[['Jane', 'Dean'], 'height':]

      height  score state
Jane     165    4.6    NY
Dean     180    1.8    AK

In [89]:
#Simultaneous selection with labels and integer location
col_names = df.columns[[2, 4]]
df.loc[['Nick', 'Cornelia'], col_names]

           food  score
Nick       Lamb    8.3
Cornelia  Beans    2.2

In [90]:
#Boolean Selection
df.loc[df['age'] > 30, ['food', 'score']]

             food  score
Dean       Cheese    1.8
Christina   Melon    9.5
Cornelia    Beans    2.2

In [91]:
#Dealing with missing values
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [92]:
list1= ['a', 'b', None]
list2= ['c', np.nan, 'd']
dict = pd.DataFrame({'a': list1,
                       'b': list2})
dict

      a    b
0     a    c
1     b  NaN
2  None    d

In [93]:
dict.isnull()

       a      b
0  False  False
1  False   True
2   True  False